In [9]:
import pandas as pd

In [10]:
pd.__version__

'2.2.2'

In [11]:
s1=pd.Series(['ferro','kinder','dairymilk','toblerone','munch'],index=[1,2,3,4,5])

In [12]:
s1

1        ferro
2       kinder
3    dairymilk
4    toblerone
5        munch
dtype: object

## DATA FRAME

 variable_name=pd.DataFrame(data,column=[column name])

In [13]:
s2=pd.Series(['black','purple','white','rosegold','blue'],index=[1,2,3,4,5])

In [14]:
s2

1       black
2      purple
3       white
4    rosegold
5        blue
dtype: object

In [15]:
df1=pd.DataFrame(s1,columns=["chocolate"])

In [16]:
df1

   chocolate
1      ferro
2     kinder
3  dairymilk
4  toblerone
5      munch

In [17]:
df1["colours"]=s2

In [18]:
df1

   chocolate   colours
1      ferro     black
2     kinder    purple
3  dairymilk     white
4  toblerone  rosegold
5      munch      blue

In [19]:
food={"veg":{1:"panner",2:"mushroom",3:"cauliflower"},"non veg":{1:"chicken",2:"crab",3:"prawn"}};

In [20]:
df2=pd.DataFrame(food,columns=["veg","non veg"])

In [21]:
df2

           veg  non veg
1       panner  chicken
2     mushroom     crab
3  cauliflower    prawn

## ACTIVITY 1
create a database for your class,containing"name","reg no","year of study"as column names for 5 students

In [27]:
Class={"Name":{1:"Kabilan",2:"Nagulan",3:"Lishanthan",4:"Pagulan",5:"skanthan"},
       "Reg no":{1:2235,2:2250,3:2267,4:2287,5:2293},
       "Yearofstudy":{1:"First",2:"Third" , 3:"Second",4:"First",5:"Fourth"}}

In [29]:
df3=pd.DataFrame(Class,columns=["Name","Reg no","Yearofstudy"])

In [30]:
df3

         Name  Reg no Yearofstudy
1     Kabilan    2235       First
2     Nagulan    2250       Third
3  Lishanthan    2267      Second
4     Pagulan    2287       First
5    skanthan    2293      Fourth

In [34]:
df2.drop("veg",axis=1)

   non veg
1  chicken
2     crab
3    prawn

In [36]:
name=df3["Name"]

In [37]:
name

1       Kabilan
2       Nagulan
3    Lishanthan
4       Pagulan
5      skanthan
Name: Name, dtype: object